app/controllers/links_controller.rb

INSERT INTO "links" ("url", "created_at", "updated_at") VALUES ('http://www.google.cl', '2011-05-30 21:34:30.317691', '2011-05-30 21:34:30.317691')
---
  def create
    @link = Link.new(params[:link])
    respond_to do |format|
      if @link.save